# ExportPatternKey Constructor (ExportPatternKey)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternKey Constructor (ExportPatternKey)
ExportPatternKey Class See Also
---
Constructs a new copy of the input ExportPatternKey object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportPatternKey(
	ExportPatternKey other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ExportPatternKey _
)
```

Visual C++
---
```text
public:
ExportPatternKey(
	ExportPatternKey^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ExportPatternKey
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportPatternKey Class
ExportPatternKey Overload
Autodesk.Revit.DB Namespace